In [1]:
from env import user, password, hostname 
import pymysql as sql
import pandas as pd
import numpy as np
np.random.seed(210)

1-2. Performed 

3.Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [2]:
def get_db_url (user, password, hostname, db_name):    
    return (f'mysql+pymysql://{user}:{password}@{hostname}/{db_name}')

4. Use your function to obtain a connection to the employees database.

In [3]:
url = get_db_url(user, password, hostname,'employees')

Once you have successfully run a query:

a. Intentionally make a typo in the database url. What kind of error message do you see?

b. Intentionally make an error in your SQL query. What does the error message look like?

In [4]:
#5
employees = pd.read_sql('SELECT * FROM employees LIMIT 5', url)
employees

#a. extra space in my syntax 
#b. gives error

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [5]:
employees.info()
#print(employees)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_no      5 non-null      int64
 1   birth_date  5 non-null      object
 2   first_name  5 non-null      object
 3   last_name   5 non-null      object
 4   gender      5 non-null      object
 5   hire_date   5 non-null      object
dtypes: int64(1), object(5)
memory usage: 368.0+ bytes

6. Read the employees and titles tables into two separate DataFrames.

In [6]:
emp = 'SELECT *FROM employees'
emp_df = pd.read_sql(emp, get_db_url(user, password, hostname,'employees'))
emp_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [ ]:
title = 'SELECT *FROM titles'
titles_df = pd.read_sql(title, get_db_url(user, password, hostname, 'employees'))
titles_df

7. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [8]:
emp_df.shape

(300024, 6)

In [9]:
titles_df.shape

(443308, 4)

8. Display the summary statistics for each DataFrame.

In [10]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

9. How many unique titles are in the titles DataFrame?

In [11]:
titles_df['title'].unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

10. What is the oldest date in the to_date column?

In [12]:
titles_df['to_date'].max()

datetime.date(9999, 1, 1)

11. What is the most recent date in the to_date column?

In [13]:
titles_df['to_date'].min()

datetime.date(1985, 3, 1)

## Exercises II

Copy the users and roles DataFrames from the examples above.

In [14]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

What is the result of using a right join on the DataFrames?

In [15]:
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'right')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [ ]:
#Tasha way: 
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'right', indicator=True)

What is the result of using an outer join on the DataFrames?

In [16]:
users.merge(roles, left_on = 'role_id', right_on = 'id', how = 'outer')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [ ]:
 users.drop('role_id', axis=1).merge(roles)

# Columns have nothing matching  because there are unable to merge.

Load the mpg dataset from PyDataset.

In [ ]:
from pydataset import data
mpg = data('mpg')
mpg.sample(8)

Output and read the documentation for the mpg dataset.

In [19]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

How many rows and columns are in the dataset?

In [20]:
mpg.shape

(234, 11)

Check out your column names and perform any cleanup you may want on them.

In [21]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

Display the summary statistics for the dataset.

In [ ]:
mpg = mpg.rename(columns = {'displ':'displacement','cyl':'cylinders'})
mpg.head(5)

In [ ]:
mpg.describe()

How many different manufacturers are there?

In [ ]:
print(list(mpg.manufacturer.unique()))
len(mpg.manufacturer.unique())

In [ ]:
#another way
mpg.manuafacture.nunique()

How many different models are there?

In [25]:
print(list(mpg.model.unique()))
len(mpg.model.unique())

['a4', 'a4 quattro', 'a6 quattro', 'c1500 suburban 2wd', 'corvette', 'k1500 tahoe 4wd', 'malibu', 'caravan 2wd', 'dakota pickup 4wd', 'durango 4wd', 'ram 1500 pickup 4wd', 'expedition 2wd', 'explorer 4wd', 'f150 pickup 4wd', 'mustang', 'civic', 'sonata', 'tiburon', 'grand cherokee 4wd', 'range rover', 'navigator 2wd', 'mountaineer 4wd', 'altima', 'maxima', 'pathfinder 4wd', 'grand prix', 'forester awd', 'impreza awd', '4runner 4wd', 'camry', 'camry solara', 'corolla', 'land cruiser wagon 4wd', 'toyota tacoma 4wd', 'gti', 'jetta', 'new beetle', 'passat']

38

Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [26]:
mpg['mileage_difference'] = mpg['hwy'] - mpg['cty'] 
mpg.head()

,manufacturer,model,display,year,cyl,trans,drv,cty,hwy,fuel,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10

Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [27]:
mpg['average_mileage'] = (mpg['hwy'] + mpg['cty']) / 2
mpg.head()

,manufacturer,model,display,year,cyl,trans,drv,cty,hwy,fuel,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0

Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [28]:
mpg['is_automatic'] = mpg['trans'].str.find('auto') >= 0
mpg.head()

,manufacturer,model,display,year,cyl,trans,drv,cty,hwy,fuel,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True

Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [29]:
mpg.groupby('manufacturer').average_mileage \
                            .mean() \
                            .sort_values(ascending=False).head(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

Do automatic or manual cars have better miles per gallon?

In [30]:
mpg.groupby('is_automatic').average_mileage \
                            .mean()

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

## Exercises III

Use your get_db_url function to help you explore the data from the chipotle database.

In [31]:
chipotle_url = get_db_url(user, password, hostname,'chipotle')
sql = 'SELECT * FROM orders'
orders = pd.read_sql(sql, chipotle_url)
orders.head()

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98

In [ ]:
orders.show()

What is the total price for each order?

In [32]:
orders['total_item_price'] = orders['quantity'] * orders['item_price']
orders.head(5)

,id,order_id,quantity,item_name,choice_description,item_price,total_item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39,$2.39
1,2,1,1,Izze,[Clementine],$3.39,$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39,$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98,$16.98 $16.98

What are the most popular 3 items?

In [33]:
orders.groupby('item_name').quantity.sum().sort_values(ascending=False).head(3)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

Which item has produced the most revenue?

In [ ]:
orders.groupby('item_name').total_item_price.sum().sort_values(ascending=False).head(1)

Join the employees and titles DataFrames together.

In [35]:
emp = 'SELECT *FROM employees'
emp_df = pd.read_sql(emp, get_db_url(user, password, hostname,'employees'))
emp_df.head()

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [36]:
title = 'SELECT *FROM titles'
titles_df = pd.read_sql(title, get_db_url(user, password, hostname, 'employees'))
titles_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [37]:
emp_titles_df = emp_df.merge(titles_df, how='inner', left_on='emp_no', right_on='emp_no')
emp_titles_df.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01

For each title, find the hire date of the employee that was hired most recently with that title.

In [ ]:
#emp_titles_df.head()
pivot_table = emp_titles_df.pivot_table(index='emp_no', columns='title', values='hire_date', aggfunc='max')

In [ ]:
#another way
emp_titles_df.groupby('title').from_date.max()

Write the code necessary to create a cross tabulation of the number of titles by department. (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)

In [ ]:
emp_titles_df.loc[emp_titles_df['to_date'] == '9999-01-01', 'to_date'] = 'titles'
recently_hired = emp_titles_df[emp_titles_df['to_date'] == 'titles']
print(recently_hired)

In [ ]:
all_titles_crosstabs = pd.crosstab(dept_title, dept_name, dept_titles.title)